tap "denisidoro/tools"
tap "fastly/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "infrahq/tap"
tap "noahgorstein/tap"
tap "warrensbox/tap"
# Record and share terminal sessions
brew "asciinema"
# Improved shell history for zsh and bash
brew "atuin"
# Configuration editing tool and API
brew "augeas"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Emoji on the command-line :scream:
brew "emojify"
# AST-based pattern checker for JavaScript
brew "eslint"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Generic syntax highlighter
brew "pygments"
# Instant coding answers via the command-line
brew "howdoi"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# NCurses Disk Usage
brew "ncdu"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Manage multiple Node.js versions
brew "nvm"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# It's not just a linter that annoys you!
brew "pylint"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Next-generation plugin manager for zsh
brew "zplug"
# A CLI for interacting with the Fastly platform
brew "fastly/tap/fastly"
# Infra
brew "infrahq/tap/infra"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Communications service
cask "amazon-chime"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Command-line display management utility
cask "cscreen"
# All-in-one toolbox for developers
cask "devutils"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Programming font
cask "font-anonymous-pro"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-monoid"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Link and retrieve key information
cask "hook"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Lightweight download manager
cask "leech"
# Cable-free audio router
cask "loopback"
# Personal productivity app
cask "marvin"
# Create and edit MP4 videos
cask "mp4tools"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Note-taking tool for networked thought
cask "roam-research"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist"
# USB and Bluetooth device driver
cask "usb-overdrive"
# Menu bar clock
cask "utc-menu-clock"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Highlights", id: 1498912833
mas "Hush", id: 1544743900
mas "Hyperspace Desktop", id: 1454139710
mas "iMovie", id: 408981434
mas "LiquidText", id: 922765270
mas "Lockdown", id: 1483255076
mas "Log-Viewer", id: 1543753042
mas "Mastonaut", id: 1450757574
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "ReadCube Papers Extension", id: 1543891759
mas "Save to Matter", id: 1548677272
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Save to Reflect", id: 1590481717
mas "Save to Roam", id: 1578763303
mas "Save to Upnext", id: 1583423832
mas "Spark", id: 1176895641
mas "TestFlight", id: 899247664
mas "Whalebird", id: 1378283354
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
