tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "noahgorstein/tap"

# Record and share terminal sessions
brew "asciinema"
# Improved shell history for zsh and bash
brew "atuin"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
# brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Emoji on the command-line :scream:
brew "emojify"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
# brew "gnu-sed"
# Tools and libraries to manipulate images in many formats
# brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Library for USB device access
brew "libusb"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Platform built on V8 to build network applications
brew "node"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Manage multiple Node.js versions
brew "nvm"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Generic syntax highlighter
brew "pygments"
# It's not just a linter that annoys you!
brew "pylint"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Utility to modify the macOS Accessibility Database (TCC.db)
# brew "tccutil"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Next-generation plugin manager for zsh
brew "zplug"
# Interactive cheatsheet tool for the command-line.
# brew "denisidoro/tools/navi"

# Application launcher and productivity software
cask "alfred"
# Communications service
cask "amazon-chime"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Command-line display management utility
cask "cscreen"
# Offline toolbox for developers
cask "devutils"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
#	some fonts
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-hack"
cask "font-monoid"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
# cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Link and retrieve key information
cask "hook"
# Terminal emulator as alternative to Apple's Terminal app
cask "iTerm2"
# Lightweight download manager
cask "leech"
# Software for Logitech devices
# cask "logitech-options"
#	Cable-free audio router
cask "loopback"
# Personal productivity app
cask "marvin"
# Create and edit MP4 videos
cask "mp4tools"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# # QuickLook plug-in that renders source code with syntax highlighting
# cask "qlcolorcode"
# # Display image info and preview unsupported formats in QuickLook
# cask "qlimagesize"
# cask "qlstephen"
# cask "quicklook-json"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
# cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Note-taking tool for networked thought
cask "roam-research"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
# cask "suspicious-package"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist"
# Time tracker
# cask "toggl-track"
# USB and Bluetooth device driver
cask "usb-overdrive"
# Menu bar clock
cask "utc-menu-clock"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# YubiKey tool
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"

#	macOs App Store software
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Hush", id: 1544743900
mas "Lockdown", id: 1483255076
mas "Microsoft Remote Desktop", id: 1295203466
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Roam", id: 1578763303
mas "Yubico Authenticator", id: 1497506650

mas "Log-Viewer", id: 1543753042
mas "Save to Reader", id: 1640236961
mas "Drafts", id: 1435957248

