tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "qmk/qmk"
# Improved shell history for zsh and bash
brew "atuin"
# Configuration editing tool and API
brew "augeas"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Emoji on the command-line :scream:
brew "emojify"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Library for USB device access
brew "libusb"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Manage multiple Node.js versions
brew "nvm"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Generic syntax highlighter
brew "pygments"
# It's not just a linter that annoys you!
brew "pylint"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Utility to modify the macOS Accessibility Database (TCC.db)
brew "tccutil"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Language for application scale JavaScript development
brew "typescript"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Next-generation plugin manager for zsh
brew "zplug"
# Interactive cheatsheet tool for the command-line.
brew "denisidoro/tools/navi"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Virtual Audio Driver
cask "blackhole-2ch"
# E-books management software
cask "calibre"
# Command-line display management utility
cask "cscreen"
# Desktop application that wraps Datasette
cask "datasette"
# Offline toolbox for developers
cask "devutils"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-hack"
cask "font-monoid"
# Desktop client for GitHub repositories
cask "github"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Link and retrieve key information
cask "hook"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop application for JupyterLab
cask "jupyterlab"
# Password manager
cask "lastpass"
# Cable-free audio router
cask "loopback"
# Personal productivity app
cask "marvin"
# Create and edit MP4 videos
cask "mp4tools"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
cask "qlstephen"
cask "quicklook-json"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# View, Screen Share, organize, import, and download files to a reMarkable device
cask "remarkable"
# Time optimising application
cask "rescuetime"
# Note-taking tool for networked thought
cask "roam-research"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
cask "suspicious-package"
# Messaging app with a focus on speed and security
cask "telegram"
# USB and Bluetooth device driver
cask "usb-overdrive"
# Menu bar clock
cask "utc-menu-clock"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Lockdown", id: 1483255076
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Save to Roam", id: 1578763303
mas "Spark", id: 1176895641
mas "Yubico Authenticator", id: 1497506650
