tap "denisidoro/tools"
tap "fastly/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "infrahq/tap"
tap "noahgorstein/tap"
tap "tbckr/tap"
tap "warrensbox/tap"
# Record and share terminal sessions
brew "asciinema"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Configuration editing tool and API
brew "augeas"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# C parser in Python
brew "pycparser", link: false
# C Foreign Function Interface for Python
brew "cffi", link: false
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cryptographic recipes and primitives for Python
brew "python-cryptography"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Emoji on the command-line :scream:
brew "emojify"
# AST-based pattern checker for JavaScript
brew "eslint"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Utilities for manipulating PostScript documents
brew "psutils"
# Generic syntax highlighter
brew "pygments"
# Instant coding answers via the command-line
brew "howdoi"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# NCurses Disk Usage
brew "ncdu"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Manage multiple Node.js versions
brew "nvm"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python package management tool
brew "poetry"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# It's not just a linter that annoys you!
brew "pylint"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# Cross-shell prompt for astronauts
brew "starship"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", link: false
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Next-generation plugin manager for zsh
brew "zplug"
# A CLI for interacting with the Fastly platform
brew "fastly/tap/fastly"
# Infra
brew "infrahq/tap/infra"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Communications service
cask "amazon-chime"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Command-line display management utility
cask "cscreen"
# Server and cloud storage browser
cask "cyberduck"
# All-in-one toolbox for developers
cask "devutils"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser focusing on privacy
cask "duckduckgo"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Programming font
cask "font-anonymous-pro"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-monoid"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Allows keymap customization on HHKB HYBRID Type-S and HYBRID models
cask "hhkb"
# Link and retrieve key information
cask "hook"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Lightweight download manager
cask "leech"
# Cable-free audio router
cask "loopback"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Personal productivity app
cask "marvin"
# Create and edit MP4 videos
cask "mp4tools"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Window snapping tool
cask "rectangle-pro"
# Time optimising application
cask "rescuetime"
# Note-taking tool for networked thought
cask "roam-research"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on Wireguard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist"
# USB and Bluetooth device driver
cask "usb-overdrive"
# Menu bar clock
cask "utc-menu-clock"
# Configurator of compatible keyboards in real time
cask "vial"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Drafts", id: 1435957248
mas "fedistar", id: 6445863996
mas "GarageBand", id: 682658836
mas "Highlights", id: 1498912833
mas "Hush", id: 1544743900
mas "Hyperspace Desktop", id: 1454139710
mas "iMovie", id: 408981434
mas "Lockdown", id: 1483255076
mas "Log-Viewer", id: 1543753042
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mona", id: 1659154653
mas "Numbers", id: 409203825
mas "Quick Camera", id: 598853070
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Save to Roam", id: 1578763303
mas "Save to Upnext", id: 1583423832
mas "Spark", id: 1176895641
mas "TestFlight", id: 899247664
mas "Wavelength", id: 1584865627
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
vscode "42Crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadawais.shades-of-purple"
vscode "ajhyndman.jslint"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.Bookmarks"
vscode "amodio.restore-editors"
vscode "AndrewButson.vscode-openai"
vscode "AndrsDC.base16-themes"
vscode "aws-scripting-guy.cform"
vscode "bceskavich.theme-dracula-at-night"
vscode "bierner.markdown-mermaid"
vscode "blinkshellinc.blink-fs"
vscode "bloop.bloop"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "castwide.solargraph"
vscode "CircleCI.circleci"
vscode "Continue.continue"
vscode "coolbear.systemd-unit-file"
vscode "CraigMaslowski.erb"
vscode "dakara.transformer"
vscode "DanielSanMedium.dscodegpt"
vscode "DavidAnson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "devdocs-adapter.devdocs-adapter"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "eternalphane.tsfmt-vscode"
vscode "everettjf.filter-line"
vscode "fabiospampinato.vscode-diff"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "jaaxxx.llm-book"
vscode "jamesls.jmespath-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "jmbeach.list-symbols"
vscode "joshwong.vscode-jmespath"
vscode "jsynowiec.vscode-insertdatestring"
vscode "junstyle.php-cs-fixer"
vscode "kddejong.vscode-cfn-lint"
vscode "kortina.vscode-markdown-notes"
vscode "kuscamara.electron"
vscode "leighlondon.eml"
vscode "mads-hartmann.bash-ide-vscode"
vscode "max-SS.Cyberpunk"
vscode "MaxCode.filemap"
vscode "mindginative.terraform-snippets"
vscode "mousetraps.selected-character-count"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "natterstefan.vs-code-toggl-extension"
vscode "nicollasr.vscode-streamdeck"
vscode "OnlyLys.leaper"
vscode "PenumbraTheme.penumbra"
vscode "philipbe.theme-gray-matter"
vscode "puppet.puppet-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "RescueTime.rescuetime"
vscode "ribragimov.tabster"
vscode "romanrei.material-dark"
vscode "sdras.night-owl"
vscode "searKing.preview-vscode"
vscode "Shopify.ruby-lsp"
vscode "smallcloud.codify"
vscode "SmukkeKim.theme-setimonokai"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhay.vscode-editor-group-minimizer"
vscode "sysoev.language-stylus"
vscode "sysoev.vscode-open-in-github"
vscode "szastupov.one-dark-pale"
vscode "tchayen.markdown-links"
vscode "techer.open-in-browser"
vscode "the-unknown.blink"
vscode "timonwong.shellcheck"
vscode "usama8800.tab-groups"
vscode "vsls-contrib.gistfs"
vscode "vsls-contrib.gitdoc"
vscode "WakaTime.vscode-wakatime"
vscode "WallabyJs.wallaby-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "witulski.selection-word-count"
vscode "yzhang.markdown-all-in-one"
