tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "warrensbox/tap"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Wrap web apps natively
brew "nativefier"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Language for application scale JavaScript development
brew "typescript"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"


# Interactive cheatsheet tool for the command-line.
brew "denisidoro/tools/navi"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"

##	general casks	##
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Desktop password and login vault
cask "bitwarden"
cask "cscreen"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Utility for customizing which browser to start
cask "finicky"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-hack"
cask "font-monoid"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
cask "marvin"
# Cloud storage client
cask "onedrive"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# View plain text files without a file extension
cask "qlstephen"
# Preview JSON files
cask "quicklook-json"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Web browser
cask "safari-technology-preview"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Time tracker
cask "toggl-track"
cask "utc-menu-clock"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Video communication and virtual meeting platform
cask "zoom"

##	Mac apps
mas "Drafts", id: 1435957248
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lockdown", id: 1483255076
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 1295203466
mas "mymind", id: 1532801185
mas "News Explorer", id: 1032670789
mas "Notability", id: 736189492
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Otter RSS", id: 1529696614
mas "Pages", id: 409201541
mas "PDF Professional", id: 1071044671
mas "QVR Client", id: 806101067
mas "Raindrop.io for Safari", id: 957810159
mas "Session Pal", id: 1515213004
mas "Spark", id: 1176895641
mas "Steam Link", id: 1246969117
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650

# for Glitch

# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"

instance_eval(File.read("/Users/cori/code/glitchdotcom/glitch/Brewfile"))
instance_eval(File.read("/Users/cori/code/glitchdotcom/Glitch-ProjectHost/Brewfile"))
